Revit 2027 API
View.GetDependentViewIds Method
 Get the ids of dependent views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetDependentViewIds()
Public Function GetDependentViewIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetDependentViewIds()
member GetDependentViewIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 Ids of the dependent views.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace